//*============================================================================
//CommonObject.cpp
//*============================================================================


//=============================================================================
//include
//=============================================================================
#include "CommonObject.h"
#include "Common/Application.h"
#include "Mouse.h"
#include "ResourceManager.h"
#include "joypad.h"
#include "GameSceneManager.h"
#include "SoundManager.h"

//=============================================================================
//variable
//=============================================================================
CApplication *CCommonObject::m_pApp = NULL;
CResourceManager *CCommonObject::m_pResMgr = NULL;
CSoundManager *CCommonObject::m_pSndMgr = NULL;
CJoyPad *CCommonObject::m_pJoyPad = NULL;
CGameSceneManager *CCommonObject::m_pGameSceneMgr = NULL;

//CMouse *CCommonObject::m_pMouse = NULL;


//=============================================================================
//コンストラクタ
//=============================================================================
CCommonObject::CCommonObject(void) 
{

}

//=============================================================================
//デストラクタ
//=============================================================================
CCommonObject::~CCommonObject(void)
{

}

//=============================================================================
//初期化処理
//=============================================================================
void CCommonObject::Initialize()
{
	
}

//=============================================================================
//終了処理
//=============================================================================
void CCommonObject::Finalize()
{

	SAFE_DELETE( m_pJoyPad );
	
	SAFE_DELETE( m_pSndMgr );
	
	SAFE_DELETE( m_pResMgr );
	
	SAFE_DELETE( m_pGameSceneMgr );

	SAFE_DELETE( m_pApp );
}


//=============================================================================
//アプリケーションクラスの取得
//=============================================================================
//[return]
//	アプリケーションクラス
//=============================================================================
CApplication *CCommonObject::GetAppli()
{
	if( m_pApp == NULL )
	{
		m_pApp = new CApplication( SCREEN_WIDTH, SCREEN_HEIGHT );
	}
	
	return m_pApp;
}

//=============================================================================
//ジョイパッドクラスの取得
//=============================================================================
//[return]
//	ジョイパッドクラス
//=============================================================================
CJoyPad *CCommonObject::GetJoyPad()
{
	if( m_pJoyPad == NULL )
	{
		m_pJoyPad = new CJoyPad();
		
		//デバイスの作成
		m_pJoyPad->CreateDevice( GetAppli()->GetCore() );
	}
	
	return m_pJoyPad;
}

//=============================================================================
//マウスクラスの取得
//=============================================================================
//[return]
//	マウスクラス
//=============================================================================
//CMouse *CCommonObject::GetMouse()
//{
//	if( m_pMouse == NULL )
//	{
//		m_pMouse = new CMouse( GetAppli()->GetCore() );
//	}
//	
//	return m_pMouse;
//}

//=============================================================================
//リソース管理クラスの取得
//=============================================================================
//[return]
//	リソース管理クラス
//=============================================================================
CResourceManager *CCommonObject::GetResMgr()
{
	if( m_pResMgr == NULL )
	{
		m_pResMgr = new CResourceManager();
	}
	
	return m_pResMgr;
}

//=============================================================================
//サウンド管理クラスの取得
//=============================================================================
//[return]
//	サウンド管理クラス
//=============================================================================
CSoundManager *CCommonObject::GetSoundMgr()
{
	if( m_pSndMgr == NULL )
	{
		m_pSndMgr = new CSoundManager();
	}
	
	return m_pSndMgr;
}


//=============================================================================
//ゲームシーンマネージャの取得
//=============================================================================
//[return]
//	ゲームシーンマネージャ
//=============================================================================
CGameSceneManager *CCommonObject::GetGameSceneMgr()
{
	if( m_pGameSceneMgr == NULL )
	{
		m_pGameSceneMgr = new CGameSceneManager();
	}
	
	return m_pGameSceneMgr;
}



