//*============================================================================
//Draw2DObject.h
//*============================================================================
//[history]
//	08/03/16 作成
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "drawobject.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	2D描画用オブジェクト
//=============================================================================
class CDraw2DObject :	public CDrawObject
{
	protected:
	
	public:
	
		CDraw2DObject( const char *pName );//コンストラクタ
		~CDraw2DObject(void);//デストラクタ
		
		virtual bool Load( ){ return true; }//ファイル読み込み
		
		void Init();//初期化
		void Exec(){}//処理
		virtual void Rendering(){}//レンダリング
		
		//パラメーターの読み込み
		void LoadParameter( const char *pFileName ){};
		
		/**
		* @brief 当たり判定
		* @param spObj 判定するオブジェクト
		* @retval true 当たっている
		* @retval false 当たっていない
		*/
		virtual bool HitCheck( sp<CDrawObject> spObj ){ return false; };
		
	public:
	
		
};
