//*============================================================================
//EffectBurst.cpp
//*============================================================================

//=============================================================================
//include
//=============================================================================
#include "EffectBurst.h"
#include "Common/Application.h"


//============================================================================
//コンストラクタ
//============================================================================
//[input]
//	pName:ファイル名
//	pDataName:データファイル名
//	vPos:位置
//===========================================================================
CEffectBurst::CEffectBurst( const char *pName, const char *pDataName, Math::Vector2D vPos )
:CEffect( pName, pDataName, vPos )
{
	m_vPos = vPos + Math::Vector2D( -8, -8 );
	m_ExistCount = 0;
	m_eType = TYPE_BOMB;
	m_eState = STATE_NONE;
}

//============================================================================
//コンストラクタ
//============================================================================
//[input]
//	pName:ファイル名
//	pDataName:データファイル名
//	vPos:位置
//===========================================================================
CEffectBurst::CEffectBurst( const char *pName, const char *pDataName, CGameObject *pObj )
:CEffect( pName, pDataName, Math::Vector2D( 0, 0 ) ),
 m_pTargetObj( pObj )
{
	m_ExistCount = 0;
	m_eType = TYPE_BOMB;
	m_eState = STATE_NONE;
}



//============================================================================
//デストラクタ
//============================================================================
CEffectBurst::~CEffectBurst(void)
{
	printf("EffectBurst:Remove\n");
}

//============================================================================
//処理
//============================================================================
void CEffectBurst::Exec()
{
	CEffect::Exec();


}

//============================================================================
//アニメーションの設定
//============================================================================
void CEffectBurst::SetAnimation()
{
	if( m_IsAnim )
	{
		/*アニメーションカウンタの増加*/
		if( ++m_AnimCount > m_AnimTime )
		{
			m_AnimCount = 0;
			m_Anim.x += m_AnimSpeed;
		}

		if( m_Anim.x >= m_DivNum.x )
		{
			this->SetRemoveFlag( true );
		}

	}

}
