//*============================================================================
//EffectFire.cpp
//*============================================================================

//=============================================================================
//include
//=============================================================================
#include "EffectFire.h"
#include "Common/Application.h"


//============================================================================
//コンストラクタ
//============================================================================
//[input]
//	pName:ファイル名
//	pDataName:データファイル名
//	vPos:位置
//===========================================================================
CEffectFire::CEffectFire( const char *pName, const char *pDataName, Math::Vector2D vPos )
:CEffect( pName, pDataName, vPos )
{
	m_ExistCount = 0;
	m_eType = TYPE_BOMB;
	m_eState = STATE_NONE;
}

//============================================================================
//コンストラクタ
//============================================================================
//[input]
//	pName:ファイル名
//	pDataName:データファイル名
//	vPos:位置
//===========================================================================
CEffectFire::CEffectFire( const char *pName, const char *pDataName, CGameObject *pObj )
:CEffect( pName, pDataName, Math::Vector2D( 0, 0 ) ),
 m_pTargetObj( pObj )
{
	m_ExistCount = 0;
	m_eType = TYPE_BOMB;
	m_eState = STATE_NONE;
}



//============================================================================
//デストラクタ
//============================================================================
CEffectFire::~CEffectFire(void)
{
	printf("EffectFire:Remove\n");
}

//============================================================================
//処理
//============================================================================
void CEffectFire::Exec()
{
	if( m_pTargetObj != NULL )
	{
		m_vPos = m_pTargetObj->GetPos() + Math::Vector2D( 105, 0 );

//		元のオブジェクトが消えたら削除
		if( m_pTargetObj->GetRemoveFlag() )
		{
			this->SetRemoveFlag( true );
		}
	}

	CEffect::Exec();

}
