//*============================================================================
//EffectTrBomb.cpp
//*============================================================================

//=============================================================================
//include
//=============================================================================
#include "EffectTrBomb.h"
#include "Common/Application.h"
#include "SoundManager.h"


//============================================================================
//コンストラクタ
//============================================================================
//[input]
//	pName:ファイル名
//	pDataName:データファイル名
//	vPos:位置
//===========================================================================
CEffectTrBomb::CEffectTrBomb( const char *pName, const char *pDataName, Math::Vector2D vPos )
:CEffectBomb( pName, pDataName, vPos )
{
	m_eType = CCharacter::TYPE_CHAINBOMB;

}

//============================================================================
//コンストラクタ
//============================================================================
//[input]
//	pName:ファイル名
//	pDataName:データファイル名
//	pObj:オブジェクト
//===========================================================================
CEffectTrBomb::CEffectTrBomb( const char *pName, const char *pDataName, CGameObject *pObj )
:CEffectBomb( pName, pDataName, pObj )
{

	m_eType = CCharacter::TYPE_CHAINBOMB;
}



//============================================================================
//デストラクタ
//============================================================================
CEffectTrBomb::~CEffectTrBomb(void)
{
}


