//*============================================================================
//EnemySmall2.cpp
//*============================================================================

//=============================================================================
//include
//=============================================================================
#include "EnemySmall2.h"
#include "ResourceManager.h"
#include "Bullet.h"
#include "Common/Application.h"
#include "SceneGameMain.h"

//============================================================================
//コンストラクタ
//============================================================================
//[input]
//	pName:ファイル名
//	pDataName:データファイル名
//	vPos:設定する位置
//===========================================================================
CEnemySmall2::CEnemySmall2( const char *pName, const char *pDataName, Math::Vector2D vPos )
:CEnemy( pName, pDataName, vPos )
{
}

//============================================================================
//デストラクタ
//============================================================================
CEnemySmall2::~CEnemySmall2(void)
{
}

//============================================================================
//アニメーションの設定
//============================================================================
void CEnemySmall2::SetAnimation()
{
	/*アニメーションカウンタの増加*/
	if( ++m_AnimCount > m_AnimTime )
	{
		m_AnimCount = 0;
		m_Anim.x += m_AnimSpeed;
	}
	 
	if( m_Anim.x >= m_DivNum.x - 1 )
	{
		m_AnimSpeed *= -1;
	}
	
	if( m_Anim.x <= 0 )
	{
		m_AnimSpeed *= -1;
	}
	
	if( m_IsDamaged )
	{
		if( m_AnimCount % 2 == 0 )
		{
			m_Anim.y ++;
		}
		
		if( m_Anim.y >= m_DivNum.y - 1 )
		{
			m_Anim.y = 0;
			m_IsDamaged = false;
		}
	}
		
}

//============================================================================
//ショット処理
//============================================================================
void CEnemySmall2::Shoot()
{
	//あるアニメーションパターンで弾を発射
	if( m_Anim.x >= 2 )
	{	
		CEnemy::Shoot();
	}
}


