//*============================================================================
//EnemySmall2.h
//*============================================================================
/**
* 敵(小型機2)クラス
*/
#pragma once

//=============================================================================
//include
//=============================================================================
#include "enemy.h"

//=============================================================================
//class
//=============================================================================
class CEnemySmall2 :	public CEnemy
{
	public:
		
		/**
		* @brief コンストラクタ
		* @param pName ファイル名
		* @param pDataName データ名
		* @param vPos 設定する位置
		*/
		CEnemySmall2( const char *pName, const char *pDataName, Math::Vector2D vPos );
		
		/**
		* @brief デストラクタ
		*/
		~CEnemySmall2(void);
		
		/**
		* @brief アニメーションの設定
		*/
		void SetAnimation();
		
		
		void Shoot();
		
	public:
	
};
