//*============================================================================
//ScoreFont.h
//*============================================================================
//[history]
//	2009/10/10　作成
//[author]
//	Taka
//============================================================================
#pragma once

//=============================================================================
//include
//=============================================================================
#include "FontSprite.h"

//=============================================================================
//class
//=============================================================================
//[Desc]
//	フォントスプライト描画用オブジェクト
//=============================================================================
class CScoreFont :	public CFontSprite
{
	private:

		bool m_IsHighScore;

	public:

		/**
		 * @brief コンストラクタ
		 * @param pName ファイル名
		 * @param pDataName　データファイル名
		 */
		CScoreFont( const char *pName, const char *pDataName );

		/**
		 * @brief デストラクタ
		 */
		virtual ~CScoreFont(void);

		/**
		 * @brief 初期化
		 */
		void Init();

		/**
		 * @brief 処理
		 */
		void Exec();

//		/**
//		 * @brief パラメーターの読み込み
//		 * @param pFileName ファイル名
//		 */
		void LoadParameter( const char *pFileName );

	public:

		/**
		 * @brief 描画
		 */
		void Draw();

};
