//*============================================================================
//SoundEffect.h
//*============================================================================
/**
* 効果音クラス
*/
#pragma once

//=============================================================================
//include
//=============================================================================
#include "SoundObject.h"

//=============================================================================
//class
//=============================================================================
//[desc]
//	効果音再生用クラス
//=============================================================================
class CSoundEffect :	public CSoundObject
{
	private:
	
		Sound::ISound *m_pSE;///<@brief 効果音再生用デバイス

	
	public:
	
		/**
		* @brief コンストラクタ
		* @param pName データ名
		*/
		CSoundEffect( const char *pName );
		
		/**
		* @brief デストラクタ
		*/
		virtual ~CSoundEffect(void);
		
		/**
		* @brief 音の再生
		*/
		virtual void Play();
		
		/**
		* @brief 音の停止
		*/
		virtual void Stop();
		
		/**
		* @brief 音の読み込み
		*/
		virtual bool Load( );
		
	/*Get系*/
	public:

		/**
		* @brief 効果音再生用デバイスの取得
		* @return 効果音再生用デバイス
		*/
		Sound::ISound *GetSEDevice() const
		{
			return m_pSE;
		}
		
};
